In [1]:
import pandas as pd

pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

/var/folders/hk/p7fcnhm10z92trzs_9kwqlyr0000gn/T/ipykernel_68679/975677578.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
data = pd.read_csv('sales_data.csv')
data.head()

,order_id,order_date,product_id,product_name,quantity_sold,unit_price,total_sales
0,1,2023-03-04,103,Jeans,1,37.39,37.39
1,2,2023-07-30,105,Sneakers,8,25.48,203.84
2,3,2023-07-16,104,Jeans,15,63.80,957.00
3,4,2023-01-08,103,T-shirt,18,48.12,866.16
4,5,2023-12-17,103,Jacket,3,35.82,107.46

In [4]:
data['order_date'] = pd.to_datetime(data['order_date'])

In [5]:
data['total_sales'] = data['quantity_sold'] * data['unit_price']

In [6]:
data.head()

,order_id,order_date,product_id,product_name,quantity_sold,unit_price,total_sales
0,1,2023-03-04,103,Jeans,1,37.39,37.39
1,2,2023-07-30,105,Sneakers,8,25.48,203.84
2,3,2023-07-16,104,Jeans,15,63.80,957.00
3,4,2023-01-08,103,T-shirt,18,48.12,866.16
4,5,2023-12-17,103,Jacket,3,35.82,107.46

In [20]:
import requests
lat = 80
lon = 80
city = 'London'
key = '96a0a3f05a4424c06a6b3aa141edc5af'
# url = f'https://api.openweathermap.org/data/2.5/weather?lat={lat}&lon={lon}&appid={key}'
url = f'https://api.openweathermap.org/data/2.5/weather?q={city}&appid={key}'

requests.get(url)

In [23]:
data = requests.get(url).json()
data

{'coord': {'lon': -0.1257, 'lat': 51.5085},
 'weather': [{'id': 500,
   'main': 'Rain',
   'description': 'light rain',
   'icon': '10n'}],
 'base': 'stations',
 'main': {'temp': 285.21,
  'feels_like': 284.85,
  'temp_min': 284.42,
  'temp_max': 286.03,
  'pressure': 1013,
  'humidity': 91},
 'visibility': 6000,
 'wind': {'speed': 1.54, 'deg': 30},
 'rain': {'1h': 0.51},
 'clouds': {'all': 100},
 'dt': 1715038142,
 'sys': {'type': 2,
  'id': 268730,
  'country': 'GB',
  'sunrise': 1715055654,
  'sunset': 1715110389},
 'timezone': 3600,
 'id': 2643743,
 'name': 'London',
 'cod': 200}

In [24]:
data_dict = {
    'City': data['name'],
    'Country': data['sys']['country'],
    'Temperature': data['main']['temp']-273.15,
    'Weather': data['weather'][0]['main'],
    'Description': data['weather'][0]['description']
}

data_df = pd.DataFrame([data_dict])

data_df.to_csv('weather.csv', index=False)